Revit 2026 API

# DocumentGetSpaceAtPoint(XYZ, Phase) Method

---

Gets a space containing the point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Space GetSpaceAtPoint(
	XYZ point,
	Phase phase
)
```
```vb
Public Function GetSpaceAtPoint (
	point As XYZ,
	phase As Phase
) As Space
```
```cpp
public:
Space^ GetSpaceAtPoint(
	XYZ^ point,
	Phase^ phase
)
```
```fsharp
member GetSpaceAtPoint :
        point : XYZ *
        phase : Phase -> Space
```

#### Parameters

point XYZ
    Point to be checked.
phase Phase
    Phase in which the space exists.

#### Return Value

SpaceThe space containing the point.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

If phase is , it will get the space of the last phase.The first one found will be returned. If there is no space containing the point, it returns .

#### Reference

Document Class

GetSpaceAtPoint Overload

Autodesk.Revit.DB Namespace